# 작업 3유형

In [3]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/krdatacertificate/e2_p3_1.csv')
print(display(df. head(5)))

     fish   height
0  fish_1  33.74cm
1  fish_2  31.64cm
2  fish_3  27.49cm
3  fish_4  31.43cm
4  fish_5  27.56cm

None

## 122마리의 height 평균값을 m(미터) 단위로 소숫점 이하 5자리까지 실수 값만 출력하라

In [14]:
# df.info()
df['height_m'] = df.height.str.replace('cm','').astype('float')
result = round((df['height_m'].mean()/100),5)
print(result)

0.29951

## 모집단의 평균길이가 30cm인지 확인하려 일표본 t검정을 시행하여 확인하려한다. 검정통계량을 소숫점 이하 3자리까지 구하여라

In [15]:
from scipy.stats import ttest_1samp

s , p = ttest_1samp(df['height_m'],30)
result = round(s,3)
print(result)

-0.217

### 위의 통계량에 대한 p-값을 구하고(반올림하여 소숫점 이하 3째자리), 유의수준 0.05 이하에서 귀무가설과 대립가설 중 유의한 가설을 하나 택하시오

In [20]:
result_1 = round(p,3)
result_2 = '귀무'
print(result_1)
print(result_2)

0.829
귀무

## 조사결과 70%의 성인 남성이 3년동안에 적어도 1번 치과를 찾는다고 할 때, 21명의 성인 남성이 임의로 추출되었다고 하자.
### 21명 중 16명 미만이 치과를 찾았을 확률 (반올림하여 소숫점 이하 3자리)

In [21]:
from scipy.stats import binom
#21명 중
n = 21
#70%가
p = 0.7
#16명 미만이
k = 16

# P ( X < k) 계산
prob = binom.cdf(k-1,n,p)
print(round(prob,3))

0.637

### 적어도 19명이 치과를 찾았을 확률 (반올림하여 소숫점 이하 3자리)

In [22]:
from scipy.stats import binom

n = 21
p = 0.7
k = 19

#P(X >= k ) 계산
prob = 1 - binom.cdf(k-1, n, p)
print(round(prob,3))

0.027

# 작업 2유형
### 정시 도착 여부 (1:정시배송, 0 : 정시미배송)
### 평가지표 f1_score

In [39]:
import pandas as pd

x_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_train.csv')
x_test = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/X_test.csv')
y_train = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/shipping/y_train.csv')

display(x_train.head())
display(y_train.head())

# print(x_train.info())
# print(x_train.nunique())
# print(x_train.isnull().sum())

drop_col = ['ID']

x_train_drop = x_train.drop(columns = drop_col)
x_test_drop = x_test.drop(columns = drop_col)
y = y_train['Reached.on.Time_Y.N']

x_train_dummies = pd.get_dummies(x_train_drop)
x_test_dummies = pd.get_dummies(x_test_drop)
x_test_dummies = x_test_dummies[x_train_dummies.columns]

# import sklearn
# print(sklearn.__all__)
# import sklearn.model_selection
# print(dir(sklearn.model_selection))

from sklearn.model_selection import train_test_split

X_T,X_V,Y_T,Y_V = train_test_split(x_train_dummies,y, test_size = 0.33 , random_state = 42)

from sklearn.ensemble import RandomForestClassifier

rf = RandomForestClassifier(random_state = 23)

rf.fit(X_T,Y_T)

predict_train = rf.predict(X_T)
predict_val = rf.predict(X_V)

from sklearn.metrics import f1_score

print('train f1 score : ' , f1_score(Y_T, predict_train))
print('val f1 score : ', f1_score(Y_V, predict_val))

predict_test = rf.predict(x_test_dummies)

result = pd.DataFrame({'ID' : x_test.ID , 'Reached.on.Time_Y.N' : predict_test})
result.to_csv('2test_2.csv',index = False)

result_check = pd.read_csv('2test_2.csv')
display(result_check)

,ID,Warehouse_block,Mode_of_Shipment,Customer_care_calls,Customer_rating,Cost_of_the_Product,Prior_purchases,Product_importance,Gender,Discount_offered,Weight_in_gms
0,6045,A,Flight,4,3,266,5,high,F,5,1590
1,44,F,Ship,3,1,174,2,low,M,44,1556
2,7940,F,Road,4,1,154,10,high,M,10,5674
3,1596,F,Ship,4,3,158,3,medium,F,27,1207
4,4395,A,Flight,5,3,175,3,low,M,7,4833

     ID  Reached.on.Time_Y.N
0  6045                    0
1    44                    1
2  7940                    1
3  1596                    1
4  4395                    1

train f1 score :  1.0
val f1 score :  0.6744089589382

         ID  Reached.on.Time_Y.N
0      6811                    1
1      4320                    0
2      5732                    0
3      7429                    1
4      2191                    1
...     ...                  ...
4396   2610                    1
4397   3406                    1
4398  10395                    1
4399   3646                    0
4400    573                    1

[4401 rows x 2 columns]